In [41]:
import pandas as pd
import numpy as np

In [42]:
ad=pd.read_csv("..\\test\\ad.csv")
click_log=pd.read_csv("..\\test\\click_log.csv")

In [43]:
ad

,creative_id,ad_id,product_id,product_category,advertiser_id,industry
0,1,1,\N,5,381,78
1,3,3,\N,5,598,165
2,4,4,\N,5,108,202
3,5,5,\N,5,109,6
4,6,6,\N,5,400,6
...,...,...,...,...,...,...
2618154,4445713,3812195,39063,17,427,\N
2618155,4445715,3812197,39063,17,427,\N
2618156,4445718,3812200,39287,17,427,\N
2618157,4445719,3812201,39287,17,427,\N
2618158,4445720,3812202,39287,17,427,\N

In [44]:
ad.describe()

        creative_id         ad_id  product_category  advertiser_id
count  2.618159e+06  2.618159e+06      2.618159e+06   2.618159e+06
mean   2.192127e+06  1.888152e+06      7.811626e+00   2.755300e+04
std    1.285008e+06  1.099371e+06      6.765412e+00   1.536021e+04
min    1.000000e+00  1.000000e+00      1.000000e+00   1.000000e+00
25%    1.077500e+06  9.400425e+05      2.000000e+00   1.513700e+04
50%    2.188608e+06  1.886218e+06      5.000000e+00   2.530500e+04
75%    3.304232e+06  2.839310e+06      1.800000e+01   3.841600e+04
max    4.445720e+06  3.812202e+06      1.800000e+01   6.296500e+04

In [45]:
ad.head(10)

   creative_id  ad_id product_id  product_category  advertiser_id industry
0            1      1         \N                 5            381       78
1            3      3         \N                 5            598      165
2            4      4         \N                 5            108      202
3            5      5         \N                 5            109        6
4            6      6         \N                 5            400        6
5            7      7         \N                 5            148      297
6           10     10         \N                 5            100       73
7           13     13         \N                 5            113      267
8           14     14         \N                 5            556        2
9           16     16         \N                 5            623        1

In [46]:
click_log["user_id"].describe()

count    3.358551e+07
mean     3.499714e+06
std      2.883313e+05
min      3.000001e+06
25%      3.249486e+06
50%      3.500907e+06
75%      3.748320e+06
max      4.000000e+06
Name: user_id, dtype: float64

In [47]:
click_log.head(10)

   time  user_id  creative_id  click_times
0    20  3131989       645764            1
1    20  3131989      1027422            1
2    20  3131989      1106443            1
3    20  3131989       629802            1
4    59  3131989      2839769            1
5    16  3131989       564033            1
6    17  3131989       103304            1
7    11  3131989       577903            1
8    20  3131989       103304            1
9    16  3131989       103304            1

In [48]:
userid=pd.unique(click_log["user_id"])

In [49]:
userid

array([3131989, 3131990, 3131994, ..., 3131984, 3131987, 3131988],
      dtype=int64)

In [50]:
len(userid)

1000000

In [51]:
type(userid)

numpy.ndarray

In [52]:
import random

In [53]:
predicted_age=[random.randint(1,10) for i in range(len(userid))]

In [54]:
predicted_gender=[random.randint(1,2) for i in range(len(userid))]

In [55]:
len(predicted_gender)

1000000

In [56]:
data=np.array([userid,predicted_age,predicted_gender])
data=np.rot90(data)
data

array([[3131988,       1,       2],
       [3131987,       2,       2],
       [3131984,       7,       1],
       ...,
       [3131994,       3,       1],
       [3131990,       3,       2],
       [3131989,       7,       1]], dtype=int64)

In [57]:
type(userid)

numpy.ndarray

In [58]:
submission=pd.DataFrame(data,columns=["user_id","predicted_age","predicted_gender"])
submission

        user_id  predicted_age  predicted_gender
0       3131988              1                 2
1       3131987              2                 2
2       3131984              7                 1
3       3131983              5                 2
4       3131979              2                 1
...         ...            ...               ...
999995  3132000              2                 2
999996  3131995              8                 2
999997  3131994              3                 1
999998  3131990              3                 2
999999  3131989              7                 1

[1000000 rows x 3 columns]

In [59]:
submission.to_csv("./submission.csv",index=False)